Revit 2026 API

# ParameterAsString Method

---

Provides access to the string contents of the parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string AsString()
```
```vb
Public Function AsString As String
```
```cpp
public:
String^ AsString()
```
```fsharp
member AsString : unit -> string
```

#### Return Value

StringThe string contained in the parameter.

The AsString method should only be used if the StorageType property returns that the internal contents of the parameter is a string.

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace